{
    "articles": {
      "police-shot-3-killed-asd3523": {
        "id": "police-shot-3-killed-asd3523",
        "title": "Three Police Officers Killed During Cockfighting Raid in Lampung",
        "date": "March 17, 2025",
        "category": "crime",
        "featuredImage": "./cnn-polri.jpeg",
        "content": [
          {
            "type": "paragraph",
            "text": "Three police officers from Way Kanan Police Station were killed during a raid on a cockfighting location on Monday (17/3) in Karang Manik Village, Negara Batin District, Way Kanan Regency, Lampung."
          },
          {
            "type": "paragraph", 
            "text": "Head of Public Relations at Lampung Police, Commissioner Yuni Iswandari confirmed the incident. Among the three victims, one was the Negara Batin Police Chief IPTU Lusiyanto."
          },
          {
            "type": "paragraph",
            "text": "The other two victims were Bripka Petrus and Bripda Ghalib. They died from gunshot wounds to the head. According to Yuni, the three were shot by unidentified persons."
          },
          {
            "type": "paragraph",
            "text": "The raided cockfighting operation was allegedly owned by military personnel. When confirmed, Kapendam II/Sriwijaya Colonel Inf Eko Syah Putra Siregar said they are currently investigating the circulating information."
          }
        ]
      },
      "ihsg-fall-mulyani-6-pcnt-32423dd": {
        "id": "ihsg-fall-mulyani-6-pcnt-32423dd", 
        "title": "Dasco After IHSG Falls 6 Percent: Sri Mulyani Won't Resign - Fiscal Remains Strong",
        "date": "March 18, 2025",
        "category": "economy",
        "featuredImage": "./cnn-dpr.jpeg",
        "content": [
          {
            "type": "paragraph",
            "text": "House of Representatives Deputy Speaker Sufmi Dasco Ahmad assured that Sri Mulyani will not resign from her position as Finance Minister in the Red and White Cabinet."
          },
          {
            "type": "paragraph",
            "text": "This was in response to questions whether today's IHSG (Jakarta Composite Index) drop was caused by rumors that Sri Mulyani would resign."
          },
          {
            "type": "paragraph",
            "text": "\"Regarding Mrs. Sri Mulyani, I can assure that Mrs. Sri Mulyani will not resign and our fiscal position remains strong,\" he said at the Indonesia Stock Exchange on Tuesday (18/3)."
          },
          {
            "type": "paragraph", 
            "text": "The Jakarta Composite Index (IHSG) plunged on Tuesday (18/3) afternoon. As of 11:49 WIB, the index fell 420.97 points or minus 6.58 percent to 6,046."
          }
        ]
      },
      "dwifungsi-abri-bill-qwjt4": {
        "id": "dwifungsi-abri-bill-qwjt4", 
        "title": "Closed TNI Bill Working Committee Meeting Marked by Protests",
        "date": "March 16, 2025",
        "category": "politics",
        "featuredImage": "./kompas-tni.jpeg",
        "content": [
          {
            "type": "paragraph",
            "text": "The working committee (panja) meeting discussing the revision of the TNI (Indonesian Military) law at a hotel in Jakarta was marked by protests from the Civil Society Coalition for Security Sector Reform. According to them, the discussion appeared secretive and could potentially restore the military's dual function (dwifungsi ABRI)."
          },
          {
            "type": "paragraph",
            "text": "On Saturday, March 16, 2025, around 17:50 WIB, three members of the Civil Society Coalition for Security Sector Reform broke through the side door of the main room. They attempted to enter and protest to the TNI Bill working committee members present."
          },
          {
            "type": "paragraph",
            "text": "However, instead of successfully entering, they were blocked by security protocols, resulting in no interaction with the committee members."
          },
          {
            "type": "paragraph",
            "text": "KontraS Deputy Coordinator and Head of Legal Division, Andri Yunus, emphasized that the TNI law revision should not be conducted in a closed and seemingly secretive manner."
          },
          {
            "type": "paragraph",
            "text": "\"We received information that the TNI law revision process was being conducted behind closed doors at the Fairmont Hotel, which we know is very luxurious, and we actually got this information from journalist colleagues,\" said KontraS Deputy Coordinator and Head of Legal Division, Andri Yunus."
          }
        ]
      },
      "sukatani-rejects-police-offer-xy123": {
        "id": "sukatani-rejects-police-offer-xy123",
        "title": "Band Sukatani: We Firmly Reject Offer to Become Police Ambassador",
        "date": "March 1, 2025",
        "category": "culture",
        "featuredImage": "./cnn-sukatani.jpeg",
        "content": [
          {
            "type": "paragraph",
            "text": "Band Sukatani firmly rejected the offer from National Police Chief General Listyo Sigit Prabowo to become Police Ambassador. The rejection was conveyed after they apologized and removed their song 'Bayar Bayar Bayar' (Pay Pay Pay)."
          },
          {
            "type": "paragraph",
            "text": "In their social media post, Sukatani also thanked the public for their support and solidarity following their viral apology video regarding their song 'Bayar Bayar Bayar' to the National Police."
          },
          {
            "type": "paragraph",
            "text": "\"Regarding the offer to become Police Ambassador from the National Police Chief, we firmly reject the offer to become Police Ambassador,\" stated Band Sukatani in their official statement on Saturday (1/3)."
          },
          {
            "type": "paragraph",
            "text": "\"The support and solidarity from friends have made us stronger and unwilling to give up,\" they explained."
          },
          {
            "type": "paragraph",
            "text": "After uploading the apology video, they said they received many offers, especially for Twister Angel who was fired from his job. These offers, they said, even came from the National Police Chief."
          },
          {
            "type": "paragraph",
            "text": "However, Band Sukatani emphasized that they will not accept the offer and will not become Police Ambassador."
          },
          {
            "type": "paragraph",
            "text": "National Police Chief General Listyo Sigit Prabowo had previously asked Band Sukatani to become Police Ambassador to provide criticism and corrections to the Police Corps."
          },
          {
            "type": "paragraph",
            "text": "Sigit emphasized that the Police Corps is currently improving and not being anti-criticism. He ensured that all his personnel accept and are open to various suggestions and input."
          }
        ]
      },
      "microsoft-quantum-computing-debate-xyz789": {
        "id": "microsoft-quantum-computing-debate-xyz789",
        "title": "Microsoft Quantum Computing Claim Still Lacks Evidence: Physicists Are Dubious",
        "date": "March 18, 2025",
        "category": "technology",
        "featuredImage": "./microsoft-quantum.webp",
        "content": [
          {
            "type": "paragraph",
            "text": "Some attendees of a packed presentation were curious about the prospect of the first 'topological' qubits, but left with questions unanswered."
          },
          {
            "type": "paragraph",
            "text": "A Microsoft researcher today presented results behind the company's controversial claim last month to have created the first 'topological' qubits — a long-sought goal of quantum computing."
          },
          {
            "type": "paragraph",
            "text": "In front of a packed room at a meeting of the American Physical Society (APS), Chetan Nayak, a theoretical physicist leading Microsoft's quantum computing effort in Redmond, Washington, explained how the company is developing topological qubits, which would be the building blocks for a noise-resistant quantum computer."
          },
          {
            "type": "quote",
            "text": "\"It's a hard problem,\" says Ali Yazdani, an experimental physicist at Princeton University in New Jersey. To anyone trying to make topological qubits, he says, \"good luck\"."
          },
          {
            "type": "paragraph",
            "text": "Daniel Loss, a theorist at the University of Basel in Switzerland, called it \"a beautiful talk\" but took issue with the strong claims and relative lack of evidence. \"People have gone overboard, and the community is not happy. They overdid it,\" he says."
          },
          {
            "type": "paragraph",
            "text": "Nayak acknowledges the criticism: \"I never felt like there would be one moment when everyone is fully convinced,\" he says, adding that Microsoft is confident in its understanding of the devices, and that other researchers are excited by the work."
          },
          {
            "type": "paragraph",
            "text": "The controversy deepened when physicist Henry Legg of the University of St Andrews, UK, posted a report questioning Microsoft's verification methods. Legg's analysis found inconsistencies in the company's topological gap protocol (TGP), a key test for detecting Majoranas in its devices."
          },
          {
            "type": "paragraph",
            "text": "Despite the ongoing debate, researchers note that the scientific review process is working as intended. \"Somebody takes a look at what someone else was doing, they poke holes,\" says Jason Alicea, a theorist at the California Institute of Technology. \"This is what scientists should be doing.\""
          }
        ]
      }
    },
    "featuredArticle": "dwifungsi-abri-bill-qwjt4",
    "popularArticles": ["dwifungsi-abri-bill-qwjt4", "ihsg-fall-mulyani-6-pcnt-32423dd", "police-shot-3-killed-asd3523"]
  }
  